{
  "homepage": "https://minecraft.curseforge.com/projects/gaia-dimension",
  "1.12.2": {
    "1.0.0": "• Gaia Dimension is officially released. This is the first version.",
    "1.0.1": "+ Added a config option for sky settings. If you turn them off, but you don't want the bland yellow skies and pink clouds, you can switch them out for another setting. These settings are preset from existing biomes.\n + Added Foggy Glass. Smelt some Salt for pristine white windows\n + Added Cloudy Glass. Can be made from Cloudy Shards.\n • Green Agate trees now check more ground to grow from. Too little space will result in no growth.\n • Due to the new generation checks, Green Agate Jungles allow for more trees to generate.\n • Fluids now mix together properly. They used to not mix at all, resulting in weird fluid behavior.\n • Fixed Gold Fire in general. CodeChickenLib spammed a tesselating block error, and some entities caused the world to crash when near this block.\n • Fixed some texture renders if ConnectedTexturesMod isn't loaded. Warned you all.\n • Rearranged the configuration file options. I would advise clearing the current config.\n • Fixed dedicated servers crashing in two places thanks to missing sided annotations.\n - Removed Dimension Seed config. Doesn't seem to work as nicely as expected.\n - Removed random config option that did nothing and was a copy-paste error.",
    "1.0.2": "+ Added Pebbles. May drop Sturdy Pebbles.\n + Added Sturdy Pebbles. Can be thrown to deal a bit of damage.\n + Added Agate Arrow. Deals a little bit more damage than Arrows.\n + Added Agate Fabric. Can be used to craft various items.\n + Added Gemstone Pouch. Can store quarter stacks of gemstones exclusive to Gaia.\n + Added Scaynyx Bucket. Can hold all fluids like a standard Bucket.\n + Added JEI Compat. Supports Restructurer and Purifier recipes, and shows burn times for each Tile Entity as averages.\n • Primal Beasts now spawn. They shall rise from the Superhot Magma underground, and maybe the land.\n • Blue Howlite Wolves now spawn in the Blue Agate Taiga. Rare, but dangerous.\n • Eating Geode Slices now gives you Agate Fabric • Consuming any Geode juices now gives you a short burst of a Potion effect. Can also be consumed at any time, even when you are not hungry.\n • Salt will now be mined at different speeds based on what tool you have.\n • Smelting Redstone and Lapis Lazuli now gives you exp.\n • Increased exp gained from smelting for Scaynyx.\n • Altered Map Colors for various blocks. Now they are accurate to what they look like.\n • Mineral Arenthis now glow in the dark.\n • Fixed extracting from Restructurer and Purifier duplicating outputs if taken with shift-clicking.\n • Fixed Pyrite Ore, Cinnabar Ore, Labradorite Ore, and Moonstone Ore smelting into Hematite. Copy-paste errors.\n • Fixed Proustite Helmet, Legs, and Boots having the same crafting recipe as Proustite Chestplate. Crafting recipes seem to glaze over me.\n • Fixed alternative crafting for Reinforced Bricks still checking for Gaia Stone Bricks metadata.\n • Fixed some blocks using CTM not properly rendering.\n • Fixed player marker on Maps spinning if the dimension uses a negative number for an ID.\n • Fixed some en_us entries.",
    "1.0.3": "• Fixed incorrect crafting recipe for Scaynyx Bucket.",
    "1.0.4": "+ New biomes: Smoldering Bog, Shining Grove.\n + New blocks: Boggy Soil, Light Soil, Murky Grass, Soft Grass, Aura Crystal Growth, Aura Shoot, Aura Log, Aura Leaves, Aura Planks, Aura Plank Slab, Aura Plank Stairs, Sparkling Rock, Impure Sludge, Impure Rock, Active Rock, Geyser Vent.\n + New items: Tilipi, Tilibl, Tiligr, Tilipu, Tiliol, Tilimy, Tiliou, Plagued Tiliey.\n + New mobs: Bismuth Uletrus.\n + New fluids: Liquid Bismuth, Liquid Aura.\n + Added Corrupt Mania effect. Damages you over time, but gives you a damage boost. Attacks from Corrupt mobs will deal additional damage.\n   + Eating Plagued Tiliey will afflict Corrupt Mania.\n + New particles for Pyrite Torch, Gaia Portal, Restructurer, and Purifier.\n • Optimised how sky colours are determined.\n • Retextured the Ancient Lagrahk and Nomadic Lagrahk.\n • Biomes got a bit bigger than last time. Note that this change will only happen in new chunks or dimensions.\n • Corrupted Growth Sappers and Contorted Nagas can now afflict Corrupt Mania.\n • Absolutely positively disabled rain in Gaia.\n • Bonemeal can now be applied to Glitter Grass, Corrupt Grass, and Soft Grass. Murky Grass does not have any effect.\n • Made Rugged Lurmorus, Ancient Lagrahk, and Nomadic Lagrahk faster.\n • Attempted to make Archaic Warriors slower.\n • General code cleanups.\n • Fixed Slabs not dropping properly if they were double-stacked.\n • Mining certain ores now drop experience orbs.",
    "1.0.5": "• Create a workaround fix for mods that try to cast where it clearly cannot. If a biome casting error persists, please report the crash to other offending mods, such as biome modifiers."
  },
  "1.14.4": {
    "1.1.0": "Gaia Dimension is now out for 1.14.4! In celebration, there's some new features not present in 1.0.5. First, there are now Stripped Logs, Wood, and Stripped Wood of all Agate Logs. Then, there's now a config option to let the portal be created anywhere, not just Hot, Dry, or Mountain biomes. Lastly, the option to change dimension ID has been removed, as these are now automatically assigned by Forge. Along with this, all Ore Dictionary entries have been removed in exchange for Tags. Some entries still exist, but most have been removed due to lack of use (if you wish to have blocks or items in tags by default in Minecraft or Forge, let me know via GitHub or Discord).",
    "1.1.1": "• Gave plants the ability to be potted, barring Crystal Growths. Now you can have a little Gaia in your home.\n • Planks are now Tiles. This makes sense because you are making these from stone trees after all.\n • Fixed errors in one of the Tags. Not sure how this got through, it does print an error in the log.\n • Fixed a crash that would occur if another mod or config errors. This is more of a patch on another issue than a fix.\n • Fixed portal particles being way too big in size. Nope, wasn't a feature.\n • Block Loot Tables are now generated. This doesn't affect anything for the user.",
    "1.1.2": "+ Added more Tags. Now certain items can now be compatible with each other in mods.\n • Fixed some loot table issues with some items inadvertently becoming unobtainable, those being Hot Dust, Goldstone Dust, and Fine Dust. This has now been corrected.\n • Generated more things. Most Blockstates, Block Models, Item Models, and Recipes are now generated.",
    "1.1.3": "Hotfix version for teleporting into the dimension. Apparently telling your users a certain feature has been fundamentally changed or having bugs reported are hard tasks, but then setting up a second environment just to rename a file and make another jar is hard, so fair's fair."
  },
  "promos": {
    "1.12.2-latest": "1.0.5",
    "1.12.2-recommended": "1.0.5",
    "1.14.4-latest": "1.1.3",
    "1.14.4-recommended": "1.1.3"
  }
}